of60/tutorials/rheoEFoam/channelEDF/PTTlinear/DebyeHuckel/0/psi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
	type            zeroGradient;   
    }
    
    outlet
    {
	type            zeroGradient;        
    }
    
    symmetry
    {
	type            symmetryPlane;    
    }
   
    walls
    {
	type            fixedValue;
	value           uniform -0.0025;         
    }

    frontAndBack
    {
	type            empty;     
    }
    
}

// ************************************************************************* //
